#MySQL数据类型
MySQL数据类型有很多，常用的有3大类：数字、字符和日期，当然还有一些其他类型比如和地理位置有关的GEOMETRY、POINT等等。这里主要描述一下常见的3大类数据类型。(MySQL 5.7版本)

##数字

|    Type   |  Storage  |  Minimum Value        |   Maximum Value   |
|           | (Bytes)    | (Signed/Unsigned)      | (Signed/Unsigned)  |
| TINYINT    | 1          | -128                   | 127                |
|           |           | 0                      | 255                |
| SMALLINT   | 2          | -32768                 | 32767              |
|           |           | 0                      | 65535              |
| MEDIUMINT  | 3          | -8388608               | 8388607            |
|           |           | 0                      | 16777215           | 
| INT        | 4          | -2147483648            | 2147483647         |
|           |           | 0                      | 4294967295         |
| BIGINT     | 8          | -9223372036854775808   | 9223372036854775807 |
|           |           | 0                      | 18446744073709551615 |