高性能MySQL
第1章 MySQL架构与历史
原子性（atomicity）：一个事务必须被视为一个不可分割的最小工作单元，整个事务中的所有操作要么全部提交成功，要么全部失败回滚，对于一个事务来说，不可能只执行其中的一部分操作，这就是事务的原子性。
一致性（consistency）：数据库总是从一个一致性的状态转换到另一个一致性的状态。
隔离性（isolation）：一个事务所做的修改在最终提交以前，对其他事务是不可见的。
持久性（durability）：一旦事务提交，则其所做的修改就会永久保存到数据库中。

4种隔离级别
Read Uncommitted（未提交读）：事务读取未提交的数据，成为脏读（Dirty Read）。
Read Committed（提交读）：两次查询可能得到不一样的结果，不可重复读（nonrepeatable read）
Repeatable Read（可重复读）：无法解决幻行（Phantom Row）。
Serializable（可串行化）：强制事务串行执行。

第2章 MySQL 基准测试

第2章 MySQL基准测试

第4章 Schema 与数据类型优化
VARCHAR 需要1或2个额外字节记录字符串长度
CHAR 会删除末尾空格
IP地址是 32 位无符号整数，可以用整数存储，MySQL提供INET_ATON()和INET_NTOA()函数用来转换。
* 避免过度设计，会导致复杂的查询
* 使用小而简单的合适数据类型，避免使用NULL值
* 尽量使用相同的数据类型存储相似或相关的值
* 注意可变长字符串
* 尽量使用整型定义标识列
* 避免使用已经遗弃的特性
* 小心使用 ENUM 和 SET

第5章 创建高性能的索引
B+Tree索引适用于全键值、键值范围或键前缀查找，键前缀只适用于最左前缀。